doc/materials.org
* TODO Шпоры
** Поля
- Заголовок (формируется на основе того, что ввёл пользователь в других полях)
  При изменении других полей эта надпись меняется автоматом через js. Пользователь должен видеть какой заголовк получается. См. пример ниже
- Название (textfield)
  Например: *Шпора от Пети для 522234*
- Преподаватель (textfield с автодополнением)
  к экзамену которого подготавливались эти шпоры
- Номер семестра относительно начала изучения предмета (select с варантами: '1ый семестр', '2ой семестр', ..., '6ой семестр')
  Например, если вы на первом курсе начали изучать физику только во втором полугодии, то укажите тут 1ый.
- Количество вопросов (всего) (textfield)
  Укажите именно общее количество вопросов к экзамену, а не количество ответов на вопросы в вашей шпоре. Это облегчит другим пользователем поиск необходимого им материала.
- Количество ответов на вопросы (textfield)
  А тут укажите именно количество вопросов, на которые есть ответы в вашей шпоре
- Список вопросов (textarea)
- Файлы (прикрепление нескольких файлов с возможностью указать описание для каждого)
- Примечания (textarea)
  Например укажите, готовы ли шпоры для печати, или же надо еще уменьшать размер шрифта.

** Примеры построения заголовков
*** Магистерская шпора 2009, 1ый семестр. (Борбот Алина Юрьевна) [29/30 вопросов]
Название: Магистерская шпора 2009
Семестр: 1ый семестр
Преподаватель: Борбот Алина Юрьевна
Количество вопросов: 30
Ответов: 29

* TODO Курсовые
** Поля
- Заголовок (выстраивается автоматически из друших полей)
- Тема (textfield)
- Автор (textfield)
- Год (textfield)
- Описание (textarea)
- Файлы (прикрепление нескольких файлов с возможностью указать описание для каждого)

** Примеры построение заголовков
*** Организация малого бизнеса в РБ. Иванов, 2010
Тема: Организация малого бизнеса в РБ
Автор: Иванов
Год: 2010
*** Организация малого бизнеса в РБ. 2010
Тема: Организация малого бизнеса в РБ
Год: 2010

* TODO Рефераты
Аналогично, как у курсовых

* TODO Дипломы
Аналогично, как у курсовых

* TODO Конспекты лекций
** Поля
- Заголовок (форматируется автоматом)
- Название (textfield)
- Преподаватель (textfield с автодополнением)
- Номер семестра (select)
- Учебный год (textfield)
- Описание (textarea)
- Файлы (прикрепление нескольких файлов с возможностью указать описание для каждого)
** Заголовки
*** Лекции по СПО, Синяков Л.И. 2010, 2ой семестр
Название: Лекции по СПО
Преподаватель: Синяков Л.И.
Год: 2010
Семестр: 2ой семестр

* TODO Лабораторные работы
** Поля
- Заголовок (формируются автоматом из других полей и пользователь его не редактирует)
- Тема (textfield)
- Номер лабораторной работы(textfield)
- Варинт (textfield)
- Описание (textarea)
  Например укажите тут задание к лабораторной работе или кому сдавалась эта лаба и в каком году.
- Файлы (прикрепление нескольких файлов с возможностью указать описание для каждого)
  Помимо решения тут можно прикрепить и задание
** Заголовок
*** Лаба №2. Командные файлы [Варинт 4]
Тема: Командные файлы
Номер лабораторной работы: 2
Вариант: 4
*** Лаба №3-5. Лабы первого семестра [Варинт 4,5,7]
Тема: 3-5
Номер лабораторной работы: Лабы первого семестра
Вариант: 4,5,7

* DONE Методические пособия и лабораторные практикумы
** Поля
- Заголовок (формируется автоматически)
- Название (textfield)
  Если есть деление по частям, то не забудьте тут указать и номер части.
- Авторы (textfield с автодополнением)
- Издательство (textfield)
  Например: *БГУИР* или *АВЕРСЭВ*...
- Год издания (textfield)
- Тип (select с вариантами: Методическое пособие, Учебный план, Лабораторный практикум, Другое)
- Содержание (textarea)
- Примечания (textarea)
  Например можно сюда указать для студентов каких факультетов предназначен этот материал.
- Файлы (прикрепление нескольких файлов с возможностью указать описание для каждого)
** Заголовки
*** История ВОВ. Новик Н.Я, Новик Я.И., БГУИР 2006 (Лаб. практикум)
Название: История ВОВ
Авторы: Новик Н.Я., Новик Я.И.
Издательство: БГУИР
Год: 2006
Тип: Лабораторный практукум
*** История ВОВ. Новик Н.Я, Новик Я.И., БГУИР 2006
Название: История ВОВ
Авторы: Новик Н.Я., Новик Я.И.
Издательство: БГУИР
Год: 2006
Тип: Другое

* TODO Книга
** Поля
- Заголовок (формируется автоматически)
- Название (textfield)
  Если есть деление по частям, то не забудьте тут указать и номер части.
- Авторы (textfield с автодополнением)
- Издательство (textfield)
  Например: *БГУИР* или *АВЕРСЭВ*...
- Год издания (textfield)
- Содержание (textarea)
- Примечания (textarea)
  Например можно сюда указать для студентов каких факультетов предназначен этот материал.
- Файлы (прикрепление нескольких файлов с возможностью указать описание для каждого)
** Заголовки
*** История ВОВ. Новик Н.Я, Новик Я.И., БГУИР 2006
Название: История ВОВ
Авторы: Новик Н.Я., Новик Я.И.
Издательство: БГУИР
Год: 2006

* DONE Типовые расчеты
** Поля
- Заголовок (формируется автоматически)
- Тема (textfield)
- Номер типового расчета (textfield)
- Вариант (textfield)
- Описание (textarea)
  Например укажите тут задание или какое-либо примечание
- Файлы (прикрепление нескольких файлов с возможностью указать описание для каждого)
  Помимо решения тут так же можно прикрепить и задание
** Заголовки
*** ТР №1. Операторный метод расчета цепей. Вариант 2
Название: Операторный метод расчета цепей
Номер ТР: 1
Вариант: 2
*** Операторный метод. Вариант 3
Название: Операторый метод
Вариант: 3
* TODO Контрольные работы
** Поля
- Заголовок (формируется автоматически)
- Тема (textfield)
- Номер контрольной (textfield)
- Вариант (textfield)
- Описание (textarea)
  Например укажите тут задание или какое-либо примечание
- Файлы (прикрепление нескольких файлов с возможностью указать описание для каждого)
  Помимо решения вы тут можете так же прикрепить и задание
** Заголовки
*** КР №2. История развития. Вариант 3
Тема: История развития
Номер: 2
Вариант: 3
* TODO Презентации
** Поля
- Название
- Описание
- Файлы (несколько файлов с описанием для каждого)

* TODO Прочее
** Поля
- Название (textfield)
- Описание (textarea)
- Файлы (несколько файлов с описанием)
